In [7]:
# Cargando librerias
import gc
import numpy as np
import pandas as pd

In [ ]:
route = "content/eventos_17-18/"
# Cargando los datos
df = pd.read_json(route + "teams.json")
df2 = pd.read_json(route + "players.json")
df3 = pd.read_json(route + "matches_England.json")

datos = {"teams": df,
         "players": df2,
         "matches_England": df3,}

## Exploratorio

In [5]:
for nombre, dato in datos.items():
    print("Informacion sobre: " + nombre)
    dato.info()
    print("_"*50)
    print(" ")
    dato.isnull().sum()
    print("_"*50)
    print(" ")

Informacion sobre: teams
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 142 entries, 0 to 141
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   city          142 non-null    object
 1   name          142 non-null    object
 2   wyId          142 non-null    int64
 3   officialName  142 non-null    object
 4   area          142 non-null    object
 5   type          142 non-null    object
dtypes: int64(1), object(5)
memory usage: 6.8+ KB
__________________________________________________

__________________________________________________

Informacion sobre: players
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3603 entries, 0 to 3602
Data columns (total 14 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   passportArea           3603 non-null   object
 1   weight                 3603 non-null   int64
 2   firstName              3603 non-null   object
 3   middleName             3603 non-null   object
 4   lastName               3603 non-null   object
 5   currentTeamId          3512 non-null   object
 6   birthDate              3603 non-null   object
 7   height                 3603 non-null   int64
 8   role                   3603 non-null   object
 9   birthArea              3603 non-null   object
 10  wyId                   3603 non-null   int64
 11  foot                   3603 non-null   object
 12  shortName              3603 non-null   object
 13  currentNationalTeamId  3603 non-null   object
dtypes: int64(3), object(11)
memory usage: 394.2+ KB
__________________________________________________

__________________________________________________

Informacion sobre: matches_England
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 380 entries, 0 to 379
Data columns (total 14 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   status         380 non-null    object
 1   roundId        380 non-null    int64
 2   gameweek       380 non-null    int64
 3   teamsData      380 non-null    object
 4   seasonId       380 non-null    int64
 5   dateutc        380 non-null    object
 6   winner         380 non-null    int64
 7   venue          380 non-null    object
 8   wyId           380 non-null    int64
 9   label          380 non-null    object
 10  date           380 non-null    object
 11  referees       380 non-null    object
 12  duration       380 non-null    object
 13  competitionId  380 non-null    int64
dtypes: int64(6), object(8)
memory usage: 41.7+ KB
__________________________________________________

__________________________________________________

### Exploracion TEAMS

In [24]:
df.head()

,city,name,wyId,officialName,area,type
0,Newcastle upon Tyne,Newcastle United,1613,Newcastle United FC,"{'name': 'England', 'id': '0', 'alpha3code': '...",club
1,Vigo,Celta de Vigo,692,Real Club Celta de Vigo,"{'name': 'Spain', 'id': '724', 'alpha3code': '...",club
2,Barcelona,Espanyol,691,Reial Club Deportiu Espanyol,"{'name': 'Spain', 'id': '724', 'alpha3code': '...",club
3,Vitoria-Gasteiz,Deportivo Alav\u00e9s,696,Deportivo Alav\u00e9s,"{'name': 'Spain', 'id': '724', 'alpha3code': '...",club
4,Valencia,Levante,695,Levante UD,"{'name': 'Spain', 'id': '724', 'alpha3code': '...",club

In [ ]:
pd.json_normalize(df["area"]).head()

      name   id alpha3code alpha2code
0  England    0        XEN
1    Spain  724        ESP         ES
2    Spain  724        ESP         ES
3    Spain  724        ESP         ES
4    Spain  724        ESP         ES

In [ ]:
# Normalizando el campo area
df["area"].apply(lambda x: x.get("name", "no encontrado")).unique()

array(['England', 'Spain', 'France', 'Germany', 'Italy', 'Wales',
       'Monaco', 'Korea Republic', 'Hungary', 'Turkey', 'Russia',
       'Sweden', 'Tunisia', 'Brazil', 'Albania', 'Romania', 'Ukraine',
       'Morocco', 'Slovakia', 'Colombia', 'Panama', 'Australia',
       'Argentina', 'Northern Ireland', 'Portugal', 'Belgium', 'Denmark',
       'Uruguay', 'Costa Rica', 'Egypt', 'Japan', 'Iran', 'Austria',
       'Iceland', 'Croatia', 'Mexico', 'Ireland Republic',
       'Czech Republic', 'Senegal', 'Peru', 'Saudi Arabia', 'Serbia',
       'Switzerland', 'Poland', 'Nigeria'], dtype=object)